# Ampacity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSize..::..Ampacity Property
GroundConductorSize Class See Also
---
Get ampacity which is used for specifying size, the unit is ampere.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public long Ampacity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Ampacity As Long
	Get
```

Visual C++
---
```text
public:
property long long Ampacity {
	long long get ();
}
```

# See Also
GroundConductorSize Class
Autodesk.Revit.DB.Electrical Namespace